{
    "workExperience": [
    {
        "position": "Senior Software Engineer",
        "company": "EPAM",
        "from": "October 2020",
        "to": "Present",
        "responsibilities": [
            "Implemented pipelines for creating and building NuGet packages and depencies.",
            "Created rule based generation tool for generating dynamic data based on a defined specification."
        ]
    },
    {
        "position": "Senior Software Engineer",
        "company": "Infor",
        "from": "November 2018",
        "to": "October 2020",
        "responsibilities": [
            "Worked as a Technical Lead for the whole team which is responsible for the overall architecture of the solution. Co-leads a technical scrum team together with other sub-team technical leads.",
            "Upgraded CPQ's designer legacy SPA implementation from using KnockoutJs and Backbone to using React, Redux built using Typescript.",
            "Successfully implemented Jest and Enzyme as a new test framework for testing React components and Redux reducers. This speeds up writing test by 80% faster due to the built-in snapshot testing included in Jest and Enzyme.",
            "Rebuilt Infor CPQ's LESS compiler algorithm to lessen the compilation time from 30 seconds down to less than a second.",
            "Minimizes code review efforts by developing a set of tools to improve integration test readability and reusability. ",
            "Successfully led Microsoft Dynamics 365 integration to Infor CPQ by developing REST and SOAP APIs on a microservices architecture.",
            "Implemented Amazon SQS for Infor CPQ's external notification services which can be consumed for Birst analytics. "
        ]
    },
    {
        "position": "Software Engineer",
        "company": "Infor",
        "from": "November 2015",
        "to": "November 2018",
        "responsibilities": [
            "Reduced merging effort for our business objects by 80%. This was accomplished by refactoring the business object publishing logic, continuous collaboration with our development head, and as a part of my initiative during his visit on our office.",
            "Led the security and source code scanning to make sure that every microservices were compliant and secured.",
            "Started the initiative for using React on Infor CPQ designer application by recreating knockout view models and templates into a React components and uses Redux for state management."
        ]
    },
    {
        "position": "Associate Software Engineer",
        "company": "Infor",
        "from": "July 2014",
        "to": "November 2015",
        "responsibilities": [
            "Successfully implemented proof of concepts of using Bootstrap grid system and LESS.js into Infor Product Configurator's styling engine.",
            "Resolved a bug for one of our key customers that makes the management team happy."
        ]
    },
    {
        "position": "Software Developer",
        "company": "Stellar",
        "from": "July 2011",
        "to": "July 2014",
        "responsibilities": [
            "Created fast and beautiful in-house applications.",
            "Conducted several product roadshows to team leads, managers, and executives.",
            "Understand and follows the company's Software Development Life Cycle."
        ]
    }]
}